maya-gc/NekoMind/iot/nekomind_firmware/sdkconfig.defaults
# Prototipo fisico documentado em origin/pipeline: ESP32-S3 com USB Serial/JTAG.
# Flash/PSRAM do modulo ainda exigem confirmacao. Serial leva apenas comandos e
# resultados; o microfone do Mac faz a captura.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_VFS_SUPPORT_IO=y
# A cena 240x320 e montada na inicializacao e exige mais que o default da main.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
